harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
    switch (ulMaskType) {
    case TCU_MASKTYPE_FIFOEMPTY:
        return(TCUInterruptFIFOEmptyMask(ulBase, ulTimerID));
    case TCU_MASKTYPE_HALF:
        return(TCUInterruptHalfMask(ulBase, ulTimerID));
    case TCU_MASKTYPE_FIFO:
        return(TCUInterruptFIFOMask(ulBase, ulTimerID));
    case TCU_MASKTYPE_FULL:
        return(TCUInterruptFullMask(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Unmask a FIFO empty interrupt of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function unmask an FIFO empty interrupt of a TCU timer.
//!
//! \return Returns true if unmask operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUInterruptFIFOEmptyUnmask(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FIFOEMCL5;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOEMASK5) != TCU_MR_FIFOEMASK5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FIFOEMCL4;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOEMASK4) != TCU_MR_FIFOEMASK4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FIFOEMCL3;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOEMASK3) != TCU_MR_FIFOEMASK3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FIFOEMCL0;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOEMASK0) != TCU_MR_FIFOEMASK0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Unmask a half comparison interrupt of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function unmask an half comparison interrupt of a TCU timer.
//!
//! \return Returns true if unmask operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUInterruptHalfUnmask(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_HMCL7;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK7) != TCU_MR_HMASK7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_HMCL6;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK6) != TCU_MR_HMASK6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_HMCL5;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK5) != TCU_MR_HMASK5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_HMCL4;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK4) != TCU_MR_HMASK4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_HMCL3;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK3) != TCU_MR_HMASK3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_HMCL2;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK2) != TCU_MR_HMASK2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_HMCL1;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK1) != TCU_MR_HMASK1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_HMCL0;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK0) != TCU_MR_HMASK0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Unmask a FIFO interrupt of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function unmask an FIFO interrupt of a TCU timer.
//!
//! \return Returns true if unmask operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUInterruptFIFOUnmask(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));
    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FIFOMCL5;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOMASK5) != TCU_MR_FIFOMASK5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FIFOMCL4;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOMASK4) != TCU_MR_FIFOMASK4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FIFOMCL3;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOMASK3) != TCU_MR_FIFOMASK3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FIFOMCL0;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOMASK0) != TCU_MR_FIFOMASK0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Unmask a full comparison interrupt of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function unmask an full comparison interrupt of a TCU timer.
//!
//! \return Returns true if unmask operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUInterruptFullUnmask(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FMCL7;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK7) != TCU_MR_FMASK7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FMCL6;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK6) != TCU_MR_FMASK6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FMCL5;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK5) != TCU_MR_FMASK5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FMCL4;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK4) != TCU_MR_FMASK4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FMCL3;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK3) != TCU_MR_FMASK3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FMCL2;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK2) != TCU_MR_FMASK2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FMCL1;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK1) != TCU_MR_FMASK1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MCR) |= TCU_MCR_FMCL0;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK0) != TCU_MR_FMASK0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Unmask an interrupt of TCU module.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulMaskType is the type of TCU interrupt.
//!
//! This function unmask an kind interrupt of a TCU timer.
//!
//! \return Returns true if unmask operation success, false others.
//
//*****************************************************************************
tBoolean
TCUInterruptUnmask(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulMaskType)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));
    ASSERT((ulMaskType == TCU_MASKTYPE_FIFOEMPTY) ||
           (ulMaskType == TCU_MASKTYPE_HALF) ||
           (ulMaskType == TCU_MASKTYPE_FIFO) ||
           (ulMaskType == TCU_MASKTYPE_FULL));

