harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
    // Not support TCU_TIMER5/TCU_TIMER6/TCU_TIMER7
    ASSERT((ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER2) ||
           (ulTimerID == TCU_TIMER1) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) |= TCU_CSR4_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_PWMEN) == TCU_CSR4_PWMEN);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) |= TCU_CSR3_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_PWMEN) == TCU_CSR3_PWMEN);
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CSR2) |= TCU_CSR2_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR2) & TCU_CSR2_PWMEN) == TCU_CSR2_PWMEN);
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CSR1) |= TCU_CSR1_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR1) & TCU_CSR1_PWMEN) == TCU_CSR1_PWMEN);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) |= TCU_CSR0_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_PWMEN) == TCU_CSR0_PWMEN);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Disable PWM output function of a TCU timer(only pure timer function).
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function disable PWM output function.
//!
//! \return Returns true if disable PWM operation success, false others.
//
//*****************************************************************************
tBoolean
TCUPWMDisable(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));

    // Not support TCU_TIMER5/TCU_TIMER6/TCU_TIMER7
    ASSERT((ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER2) ||
           (ulTimerID == TCU_TIMER1) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) &= ~TCU_CSR4_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_PWMEN) != TCU_CSR4_PWMEN);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) &= ~TCU_CSR3_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_PWMEN) != TCU_CSR3_PWMEN);
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CSR2) &= ~TCU_CSR2_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR2) & TCU_CSR2_PWMEN) != TCU_CSR2_PWMEN);
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CSR1) &= ~TCU_CSR1_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR1) & TCU_CSR1_PWMEN) != TCU_CSR1_PWMEN);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) &= ~TCU_CSR0_PWMEN;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_PWMEN) != TCU_CSR0_PWMEN);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! PWM initialize output level set.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulPWMInitialOutputLevel is the the TCU PWM initial output level.
//!
//! This function set PWM initial output level of a TCU1 timer.
//!
//! \return Returns true if shutdown operation success, false others.
//
//*****************************************************************************
tBoolean
TCUPWMInitialOutputLevelSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulPWMInitialOutputLevel)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));
    ASSERT((ulPWMInitialOutputLevel == TCU_PWMINITOUTPUT_LOW) ||
           (ulPWMInitialOutputLevel == TCU_PWMINITOUTPUT_HIGH));

    switch (ulPWMInitialOutputLevel) {
    case TCU_PWMINITOUTPUT_LOW:
        return(TCUPWMInitialOutputLowLevelSet(ulBase, ulTimerID));
    case TCU_PWMINITOUTPUT_HIGH:
        return(TCUPWMInitialOutputHighLevelSet(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Shut down(Abrupt mode) PWM output of a TCU1 timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function using abupt mode to shut down PWM output of a TCU1 timer.
//!
//! \return Returns true if shutdown operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUPWMShutdownAbrupt(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerTCU1Valid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CSR7) |= TCU_CSR7_SD;
        return((HWREGH(ulBase + TCU_O_CSR7) & TCU_CSR7_SD) == TCU_CSR7_SD);
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CSR6) |= TCU_CSR6_SD;
        return((HWREGH(ulBase + TCU_O_CSR6) & TCU_CSR6_SD) == TCU_CSR6_SD);
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CSR5) |= TCU_CSR5_SD;
        return((HWREGH(ulBase + TCU_O_CSR5) & TCU_CSR5_SD) == TCU_CSR5_SD);
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) |= TCU_CSR4_SD;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_SD) == TCU_CSR4_SD);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) |= TCU_CSR3_SD;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_SD) == TCU_CSR3_SD);
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CSR2) |= TCU_CSR2_SD;
        return((HWREGH(ulBase + TCU_O_CSR2) & TCU_CSR2_SD) == TCU_CSR2_SD);
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CSR1) |= TCU_CSR1_SD;
        return((HWREGH(ulBase + TCU_O_CSR1) & TCU_CSR1_SD) == TCU_CSR1_SD);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) |= TCU_CSR0_SD;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_SD) == TCU_CSR0_SD);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Shut down PWM output of a TCU1 timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulShutdown is the shut down mode, graceful or abrupt.
//!
//! This function shut down PWM output of a TCU1 timer.
//!
//! \return Returns true if shutdown operation success, false others.
//
//*****************************************************************************
tBoolean
TCUPWMShutdown(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulShutdown)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerTCU1Valid(ulTimerID));
    ASSERT((ulShutdown == TCU_SHUTDOWN_GRACEFUL) ||
           (ulShutdown == TCU_SHUTDOWN_ABRUPT));

    switch (ulShutdown) {
    case TCU_SHUTDOWN_GRACEFUL:
        return(TCUPWMShutdownGraceful(ulBase, ulTimerID));
    case TCU_SHUTDOWN_ABRUPT:
        return(TCUPWMShutdownAbrupt(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Set the TCU Timer clock input prescale.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulClockInputPrescale is the OST clock input prescale.
//!
//! This function set TCU Timer clock input prescale.
//!
//! \return None.
//
//*****************************************************************************
tBoolean
TCUClockInputPrescaleSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulClockInputPrescale)
{
    unsigned long prescale_field = 0;

    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));
    ASSERT((ulClockInputPrescale == TCU_CLOCKPRESCALE_1) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_4) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_16) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_64) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_256) ||
           (ulClockInputPrescale == TCU_CLOCKPRESCALE_1024));

    switch (ulClockInputPrescale) {
    case TCU_CLOCKPRESCALE_1:
        prescale_field = TCU_CSR_PRESCALE_1;
        break;
    case TCU_CLOCKPRESCALE_4:
        prescale_field = TCU_CSR_PRESCALE_4;
        break;
    case TCU_CLOCKPRESCALE_16:
        prescale_field = TCU_CSR_PRESCALE_16;
        break;
    case TCU_CLOCKPRESCALE_64:
        prescale_field = TCU_CSR_PRESCALE_64;
        break;
    case TCU_CLOCKPRESCALE_256:
        prescale_field = TCU_CSR_PRESCALE_256;
        break;
    case TCU_CLOCKPRESCALE_1024:
        prescale_field = TCU_CSR_PRESCALE_1024;
        break;
    default:
        ASSERT(false);
        return(false);
    }

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CSR7) &= ~TCU_CSR7_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR7) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR7) & TCU_CSR7_PRESCALE) == prescale_field);
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CSR6) &= ~TCU_CSR6_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR6) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR6) & TCU_CSR6_PRESCALE) == prescale_field);
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CSR5) &= ~TCU_CSR5_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR5) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR5) & TCU_CSR5_PRESCALE) == prescale_field);
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) &= ~TCU_CSR4_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR4) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_PRESCALE) == prescale_field);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) &= ~TCU_CSR3_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR3) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_PRESCALE) == prescale_field);
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CSR2) &= ~TCU_CSR2_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR2) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR2) & TCU_CSR2_PRESCALE) == prescale_field);
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CSR1) &= ~TCU_CSR1_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR1) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR1) & TCU_CSR1_PRESCALE) == prescale_field);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) &= ~TCU_CSR0_PRESCALE;
        HWREGH(ulBase + TCU_O_CSR0) |= prescale_field;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_PRESCALE) == prescale_field);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Set the TCU Timer clock input(clock source).
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulClockInputPrescale is the OST clock input prescale.
//!
//! This function set TCU Timer clock input.
//!
//! \return None.
//
//*****************************************************************************
tBoolean
TCUClockInputSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulClockInput)
{
    unsigned long ulMask=0;
    unsigned long ulPrescale = 0;

    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));
    ASSERT(ulClockInput == TCU_CLOCKINPUT_EXTAL ||
           ulClockInput == TCU_CLOCKINPUT_RTC   ||
           ulClockInput == TCU_CLOCKINPUT_PCLK);

    ulMask = TCU_CSR0_EXTEN | TCU_CSR0_RTCEN | TCU_CSR0_PCKEN;

