harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
    switch (ulClockInput) {
    case TCU_CLOCKINPUT_EXTAL:
        ulPrescale = TCU_CSR0_EXTEN;
        break;
    case TCU_CLOCKINPUT_RTC:
        ulPrescale = TCU_CSR0_RTCEN;
        break;
    case TCU_CLOCKINPUT_PCLK:
        ulPrescale = TCU_CSR0_PCKEN;
        break;
    default:
        ASSERT(false);
        return(false);
    }

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CSR7) &= ~ulMask;
        HWREGH(ulBase + TCU_O_CSR7) |= ulPrescale;
        return((HWREGH(ulBase + TCU_O_CSR7) & ulMask) == ulPrescale);
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CSR6) &= ~ulMask;
        HWREGH(ulBase + TCU_O_CSR6) |= ulPrescale;
        return((HWREGH(ulBase + TCU_O_CSR6) & ulMask) == ulPrescale);
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CSR5) &= ~ulMask;
        HWREGH(ulBase + TCU_O_CSR5) |= ulPrescale;
        return((HWREGH(ulBase + TCU_O_CSR5) & ulMask) == ulPrescale);
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) &= ~ulMask;
        HWREGH(ulBase + TCU_O_CSR4) |= ulPrescale;
        return((HWREGH(ulBase + TCU_O_CSR4) & ulMask) == ulPrescale);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) &= ~ulMask;
        HWREGH(ulBase + TCU_O_CSR3) |= ulPrescale;
        return((HWREGH(ulBase + TCU_O_CSR3) & ulMask) == ulPrescale);
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CSR2) &= ~ulMask;
        HWREGH(ulBase + TCU_O_CSR2) |= ulPrescale;
        return((HWREGH(ulBase + TCU_O_CSR2) & ulMask) == ulPrescale);
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CSR1) &= ~ulMask;
        HWREGH(ulBase + TCU_O_CSR1) |= ulPrescale;
        return((HWREGH(ulBase + TCU_O_CSR1) & ulMask) == ulPrescale);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) &= ~ulMask;
        HWREGH(ulBase + TCU_O_CSR0) |= ulPrescale;
        return((HWREGH(ulBase + TCU_O_CSR0) & ulMask) == ulPrescale);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Set the TCU fifo empty comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function set TCU fifo empty comparison match flag.
//!
//! \return Returns true if success, flase others.
//
//*****************************************************************************
static tBoolean
TCUComparisonFIFOEmptyMatchFlagSet(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FIFOESET5;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOEFLAG5) == TCU_FR_FIFOEFLAG5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FIFOESET4;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOEFLAG4) == TCU_FR_FIFOEFLAG4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FIFOESET3;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOEFLAG3) == TCU_FR_FIFOEFLAG3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FIFOESET0;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOEFLAG0) == TCU_FR_FIFOEFLAG0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Set the TCU half comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function set TCU half comparison match flag.
//!
//! \return Returns true if success, flase others.
//
//*****************************************************************************
static tBoolean
TCUComparisonHalfMatchFlagSet(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_HFST7;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG7) == TCU_FR_HFLAG7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_HFST6;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG6) == TCU_FR_HFLAG6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_HFST5;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG5) == TCU_FR_HFLAG5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_HFST4;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG4) == TCU_FR_HFLAG4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_HFST3;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG3) == TCU_FR_HFLAG3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_HFST2;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG2) == TCU_FR_HFLAG2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_HFST1;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG1) == TCU_FR_HFLAG1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_HFST0;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG0) == TCU_FR_HFLAG0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Set the TCU fifo comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function set TCU fifo comparison match flag.
//!
//! \return Returns true if success, flase others.
//
//*****************************************************************************
static tBoolean
TCUComparisonFIFOMatchFlagSet(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FIFOST5;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOFLAG5) == TCU_FR_FIFOFLAG5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FIFOST4;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOFLAG4) == TCU_FR_FIFOFLAG4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FIFOST3;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOFLAG3) == TCU_FR_FIFOFLAG3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FIFOST0;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOFLAG0) == TCU_FR_FIFOFLAG0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Set the TCU full comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function set TCU full comparison match flag.
//!
//! \return Returns true if success, flase others.
//
//*****************************************************************************
static tBoolean
TCUComparisonFullMatchFlagSet(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerTCU1Valid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FFST7;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG7) == TCU_FR_FFLAG7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FFST6;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG6) == TCU_FR_FFLAG6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FFST5;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG5) == TCU_FR_FFLAG5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FFST4;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG4) == TCU_FR_FFLAG4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FFST3;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG3) == TCU_FR_FFLAG3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_FSR) |= TCU_FSR_FFST0;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG0) == TCU_FR_FFLAG0);
    case TCU_TIMER2:
    case TCU_TIMER1:
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Set the TCU comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulFlagType is the type of the TCU timer flag, full/half/fifoempty/fifo.
//!
//! This function set TCU comparison match flag.
//!
//! \return .
//
//*****************************************************************************
tBoolean
TCUComparisonMatchFlagSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulFlagType)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));
    ASSERT((ulFlagType == TCU_FLAGTYPE_FIFOEMPTY) ||
           (ulFlagType == TCU_FLAGTYPE_HALF) ||
           (ulFlagType == TCU_FLAGTYPE_FIFOFULL) ||
           (ulFlagType == TCU_FLAGTYPE_FULL));


