harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
    switch (ulFlagType) {
    case TCU_FLAGTYPE_FIFOEMPTY:
        return(TCUComparisonFIFOEmptyMatchFlagSet(ulBase, ulTimerID));
    case TCU_FLAGTYPE_HALF:
        return(TCUComparisonHalfMatchFlagSet(ulBase, ulTimerID));
    case TCU_FLAGTYPE_FIFOFULL:
        return(TCUComparisonFIFOMatchFlagSet(ulBase, ulTimerID));
    case TCU_FLAGTYPE_FULL:
        return(TCUComparisonFullMatchFlagSet(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Clear the TCU fifo empty comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function clear TCU fifo empty comparison match flag.
//!
//! \return Returns true if success, flase others.
//
//*****************************************************************************
static tBoolean
TCUComparisonFIFOEmptyMatchFlagClear(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FIFOECL5;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOEFLAG5) != TCU_FR_FIFOEFLAG5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FIFOECL4;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOEFLAG4) != TCU_FR_FIFOEFLAG4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FIFOECL3;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOEFLAG3) != TCU_FR_FIFOEFLAG3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FIFOECL0;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOEFLAG0) != TCU_FR_FIFOEFLAG0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Clear the TCU half comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function clear TCU half comparison match flag.
//!
//! \return Returns true if success, flase others.
//
//*****************************************************************************
static tBoolean
TCUComparisonHalfMatchFlagClear(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_HFCL7;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG7) != TCU_FR_HFLAG7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_HFCL6;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG6) != TCU_FR_HFLAG6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_HFCL5;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG5) != TCU_FR_HFLAG5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_HFCL4;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG4) != TCU_FR_HFLAG4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_HFCL3;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG3) != TCU_FR_HFLAG3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_HFCL2;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG2) != TCU_FR_HFLAG2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_HFCL1;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG1) != TCU_FR_HFLAG1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_HFCL0;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_HFLAG0) != TCU_FR_HFLAG0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Clear the TCU fifo comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function clear TCU fifo comparison match flag.
//!
//! \return Returns true if success, flase others.
//
//*****************************************************************************
static tBoolean
TCUComparisonFIFOMatchFlagClear(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FIFOCL5;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOFLAG5) != TCU_FR_FIFOFLAG5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FIFOCL4;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOFLAG4) != TCU_FR_FIFOFLAG4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FIFOCL3;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOFLAG3) != TCU_FR_FIFOFLAG3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FIFOCL0;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FIFOFLAG0) != TCU_FR_FIFOFLAG0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Clear the TCU full comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function clear TCU full comparison match flag.
//!
//! \return Returns true if success, flase others.
//
//*****************************************************************************
static tBoolean
TCUComparisonFullMatchFlagClear(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerTCU1Valid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FFCL7;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG7) != TCU_FR_FFLAG7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FFCL6;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG6) != TCU_FR_FFLAG6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FFCL5;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG5) != TCU_FR_FFLAG5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FFCL4;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG4) != TCU_FR_FFLAG4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FFCL3;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG3) != TCU_FR_FFLAG3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_FCR) |= TCU_FCR_FFCL0;
        return((HWREG(ulBase + TCU_O_FR) & TCU_FR_FFLAG0) != TCU_FR_FFLAG0);
    case TCU_TIMER2:
    case TCU_TIMER1:
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Clear the TCU comparison match flag.
//!
//! \param ulBase is the base address of the OST.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function clear TCU comparison match flag.
//!
//! \return .
//
//*****************************************************************************
tBoolean
TCUComparisonMatchFlagClear(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulFlagType)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));
    ASSERT((ulFlagType == TCU_FLAGTYPE_FIFOEMPTY) ||
           (ulFlagType == TCU_FLAGTYPE_HALF) ||
           (ulFlagType == TCU_FLAGTYPE_FIFOFULL) ||
           (ulFlagType == TCU_FLAGTYPE_FULL));


