harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
    switch (ulFlagType) {
    case TCU_FLAGTYPE_FIFOEMPTY:
        return(TCUComparisonFIFOEmptyMatchFlagClear(ulBase, ulTimerID));
    case TCU_FLAGTYPE_HALF:
        return(TCUComparisonHalfMatchFlagClear(ulBase, ulTimerID));
    case TCU_FLAGTYPE_FIFOFULL:
        return(TCUComparisonFIFOMatchFlagClear(ulBase, ulTimerID));
    case TCU_FLAGTYPE_FULL:
        return(TCUComparisonFullMatchFlagClear(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Print all register value of TCU.
//!
//! \param ulBase is the base address of the TCU.
//! \param print is a function pointer like printf.
//!
//! This function print value of all register in a TCU.
//!
//! \return none
//
//*****************************************************************************
void
TCURegisterDump(unsigned long ulBase, int (*print)(const char *format, ...))
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));

    REGH_PRINT(TCU_O_ER, ulBase, print);
    REG_PRINT(TCU_O_SR, ulBase, print);
    REG_PRINT(TCU_O_FR, ulBase, print);
    REG_PRINT(TCU_O_MR, ulBase, print);
    REGH_PRINT(TCU_O_DFR0, ulBase, print);
    REGH_PRINT(TCU_O_DHR0, ulBase, print);
    REGH_PRINT(TCU_O_CNT0, ulBase, print);
    REGH_PRINT(TCU_O_CSR0, ulBase, print);
    REGH_PRINT(TCU_O_DFR1, ulBase, print);
    REGH_PRINT(TCU_O_DHR1, ulBase, print);
    REGH_PRINT(TCU_O_CNT1, ulBase, print);
    REGH_PRINT(TCU_O_CSR1, ulBase, print);
    REGH_PRINT(TCU_O_DFR2, ulBase, print);
    REGH_PRINT(TCU_O_DHR2, ulBase, print);
    REGH_PRINT(TCU_O_CNT2, ulBase, print);
    REGH_PRINT(TCU_O_CSR2, ulBase, print);
    REGH_PRINT(TCU_O_DFR3, ulBase, print);
    REGH_PRINT(TCU_O_DHR3, ulBase, print);
    REGH_PRINT(TCU_O_CNT3, ulBase, print);
    REGH_PRINT(TCU_O_CSR3, ulBase, print);
    REGH_PRINT(TCU_O_DFR4, ulBase, print);
    REGH_PRINT(TCU_O_DHR4, ulBase, print);
    REGH_PRINT(TCU_O_CNT4, ulBase, print);
    REGH_PRINT(TCU_O_CSR4, ulBase, print);
    REGH_PRINT(TCU_O_DFR5, ulBase, print);
    REGH_PRINT(TCU_O_DHR5, ulBase, print);
    REGH_PRINT(TCU_O_CNT5, ulBase, print);
    REGH_PRINT(TCU_O_CSR5, ulBase, print);
    REGH_PRINT(TCU_O_DFR6, ulBase, print);
    REGH_PRINT(TCU_O_DHR6, ulBase, print);
    REGH_PRINT(TCU_O_CNT6, ulBase, print);
    REGH_PRINT(TCU_O_CSR6, ulBase, print);
    REGH_PRINT(TCU_O_DFR7, ulBase, print);
    REGH_PRINT(TCU_O_DHR7, ulBase, print);
    REGH_PRINT(TCU_O_CNT7, ulBase, print);
    REGH_PRINT(TCU_O_CSR7, ulBase, print);
    REG_PRINT(TCU_O_STR, ulBase, print);
    REGH_PRINT(TCU_O_MODE0, ulBase, print);
    REGH_PRINT(TCU_O_FWD0, ulBase, print);
    REGH_PRINT(TCU_O_FWD0, ulBase, print);
    REGH_PRINT(TCU_O_FIFOSR0, ulBase, print);
    REGH_PRINT(TCU_O_MODE3, ulBase, print);
    REGH_PRINT(TCU_O_FWD3, ulBase, print);
    REGH_PRINT(TCU_O_FWD3, ulBase, print);
    REGH_PRINT(TCU_O_FIFOSR3, ulBase, print);
    REGH_PRINT(TCU_O_MODE4, ulBase, print);
    REGH_PRINT(TCU_O_FWD4, ulBase, print);
    REGH_PRINT(TCU_O_FWD4, ulBase, print);
    REGH_PRINT(TCU_O_FIFOSR4, ulBase, print);
    REGH_PRINT(TCU_O_MODE5, ulBase, print);
    REGH_PRINT(TCU_O_FWD5, ulBase, print);
    REGH_PRINT(TCU_O_FWD5, ulBase, print);
    REGH_PRINT(TCU_O_FIFOSR5, ulBase, print);
}

//*****************************************************************************
//
//! \internal
//! Set the nonfifo mode of TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of a TCU timer.
//!
//! This function set non fifo mode of a TCU timer.
//!
//! \return Return true if set operation success, false others
//
//*****************************************************************************
static tBoolean
TCUModeNonFIFOSet(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(TCU_BASE + TCU_O_MODE5) &= ~TCU_MODE5_FIFOMOD;
        return((HWREG(TCU_BASE + TCU_O_MODE5) & TCU_MODE5_FIFOMOD) != TCU_MODE5_FIFOMOD);
    case TCU_TIMER4:
        HWREG(TCU_BASE + TCU_O_MODE4) &= ~TCU_MODE4_FIFOMOD;
        return((HWREG(TCU_BASE + TCU_O_MODE4) & TCU_MODE4_FIFOMOD) != TCU_MODE4_FIFOMOD);
    case TCU_TIMER3:
        HWREG(TCU_BASE + TCU_O_MODE3) &= ~TCU_MODE3_FIFOMOD;
        return((HWREG(TCU_BASE + TCU_O_MODE3) & TCU_MODE3_FIFOMOD) != TCU_MODE3_FIFOMOD);
    case TCU_TIMER0:
        HWREG(TCU_BASE + TCU_O_MODE0) &= ~TCU_MODE0_FIFOMOD;
        return((HWREG(TCU_BASE + TCU_O_MODE0) & TCU_MODE0_FIFOMOD) != TCU_MODE0_FIFOMOD);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Set the FIFO mode of TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of a TCU timer.
//!
//! This function set FIFO mode of a TCU timer.
//!
//! \return Return true if set operation success, false others
//
//*****************************************************************************
static tBoolean
TCUModeFIFOSet(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(TCU_BASE + TCU_O_MODE5) |= TCU_MODE5_FIFOMOD;
        return((HWREG(TCU_BASE + TCU_O_MODE5) & TCU_MODE5_FIFOMOD) == TCU_MODE5_FIFOMOD);
    case TCU_TIMER4:
        HWREG(TCU_BASE + TCU_O_MODE4) |= TCU_MODE4_FIFOMOD;
        return((HWREG(TCU_BASE + TCU_O_MODE4) & TCU_MODE4_FIFOMOD) == TCU_MODE4_FIFOMOD);
    case TCU_TIMER3:
        HWREG(TCU_BASE + TCU_O_MODE3) |= TCU_MODE3_FIFOMOD;
        return((HWREG(TCU_BASE + TCU_O_MODE3) & TCU_MODE3_FIFOMOD) == TCU_MODE3_FIFOMOD);
    case TCU_TIMER0:
        HWREG(TCU_BASE + TCU_O_MODE0) |= TCU_MODE0_FIFOMOD;
        return((HWREG(TCU_BASE + TCU_O_MODE0) & TCU_MODE0_FIFOMOD) == TCU_MODE0_FIFOMOD);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Set the mode of TCU.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of a TCU timer.
//! \param ulMode is the mode of TCU timer.
//!
//! This function set a mode of a TCU timer, mode can be FIFO or NONFIFO.
//!
//! \return Return true if set operation success, false others
//
//*****************************************************************************
tBoolean
TCUModeSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulMode)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));
    ASSERT((ulMode == TCU_MODE_NONFIFO) ||
           (ulMode == TCU_MODE_FIFO));

