harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
    switch (ulMode) {
    case TCU_MODE_NONFIFO:
        return(TCUModeNonFIFOSet(ulBase, ulTimerID));
    case TCU_MODE_FIFO:
        return(TCUModeFIFOSet(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Set the FIFO1 mode of TCU.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of a TCU timer.
//!
//! This function set a FIFO(FIFO1) mode of a TCU timer
//!
//! \return Return true if set operation success, false others
//
//*****************************************************************************
static tBoolean
TCUFIFOModeFIFO1Set(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MODE5) &= ~TCU_MODE5_CYCST;
        return((HWREG(ulBase + TCU_O_MODE5) & TCU_MODE5_CYCST) != TCU_MODE5_CYCST);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MODE4) &= ~TCU_MODE4_CYCST;
        return((HWREG(ulBase + TCU_O_MODE4) & TCU_MODE4_CYCST) != TCU_MODE4_CYCST);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MODE3) &= ~TCU_MODE3_CYCST;
        return((HWREG(ulBase + TCU_O_MODE3) & TCU_MODE3_CYCST) != TCU_MODE3_CYCST);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MODE0) &= ~TCU_MODE0_CYCST;
        return((HWREG(ulBase + TCU_O_MODE0) & TCU_MODE0_CYCST) != TCU_MODE0_CYCST);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Set the FIFO2 mode of TCU.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of a TCU timer.
//!
//! This function set a FIFO(FIFO2) mode of a TCU timer.
//!
//! \return Return true if set operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUFIFOModeFIFO2Set(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MODE5) |= TCU_MODE5_CYCST;
        return((HWREG(ulBase + TCU_O_MODE5) & TCU_MODE5_CYCST) == TCU_MODE5_CYCST);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MODE4) |= TCU_MODE4_CYCST;
        return((HWREG(ulBase + TCU_O_MODE4) & TCU_MODE4_CYCST) == TCU_MODE4_CYCST);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MODE3) |= TCU_MODE3_CYCST;
        return((HWREG(ulBase + TCU_O_MODE3) & TCU_MODE3_CYCST) == TCU_MODE3_CYCST);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MODE0) |= TCU_MODE0_CYCST;
        return((HWREG(ulBase + TCU_O_MODE0) & TCU_MODE0_CYCST) == TCU_MODE0_CYCST);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Set the FIFO(1/2)mode of TCU.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of a TCU timer.
//! \param ulFIFOMode is the FIFO mode of TCU timer.
//!
//! This function set a FIFO mode of a TCU timer, mode can be FIFO1 or FIFO2.
//!
//! \return Return true if set operation success, false others
//
//*****************************************************************************
tBoolean
TCUFIFOModeSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulFIFOMode)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));
    ASSERT((ulFIFOMode == TCU_FIFOMODE_FIFO1) ||
           (ulFIFOMode == TCU_FIFOMODE_FIFO2));

    switch (ulFIFOMode) {
    case TCU_FIFOMODE_FIFO1:
        return(TCUFIFOModeFIFO1Set(ulBase, ulTimerID));
    case TCU_FIFOMODE_FIFO2:
        return(TCUFIFOModeFIFO2Set(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Set the FIFO2 number of TCU.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of a TCU timer.
//! \param ulNumber is number(size) of FIFO2 TCU timer mode.
//!
//! This function set a FIFO2 FIFO number of a TCU timer.
//!
//! \return Return true if set operation success, false others
//
//*****************************************************************************
tBoolean
TCUFIFO2NumberSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulNumber)
{
    //
    // Checks the arguments
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MODE5) |= TCU_MODE5_FIFONUMST;
        HWREG(ulBase + TCU_O_MODE5) |= ulNumber << 4;
        return(false);
    default:
        ASSERT(false);
        return(false);
    }
}
